[{
  "recipe" : "Bourbon Chicken",
  "recipe-id": "1",
  "photo_url": "assets/Bourbon-chicken.jpg",
  "ingredients": "2 lbs boneless chicken breasts, cut into bite-size pieces\n1 -2 tablespoon olive oil1 garlic clove, crushed\n1⁄4 teaspoon ginger\n3⁄4 teaspoon crushed red pepper flakes\n1⁄4 cup apple juice\n1⁄3 cup light brown sugar\n2 tablespoons ketchup\n1 tablespoon cider vinegar\n1⁄2 cup water\n1⁄3 cup soy sauce",
  "directions": "Editor's Note: Named Bourbon Chicken because it was supposedly created by a Chinese cook who worked in a restaurant on Bourbon Street.\n- Heat oil in a large skillet.\n- Add chicken pieces and cook until lightly browned.\n- Remove chicken.\n- Add remaining ingredients, heating over medium Heat until well mixed and dissolved.\n- Add chicken and bring to a hard boil.\n- Reduce heat and simmer for 20 minutes.\n- Serve over hot rice and ENJOY."
},{
  "recipe" : "Dark Chocolate Cake",
  "recipe-id": "2",
  "photo_url": "assets/choc-cake.jpg",
  "ingredients": "2 cups sugar\n1 3⁄4 cups flour\n3⁄4 cup baking cocoa (dutch process)\n1 1⁄2 teaspoons baking powder\n1 1⁄2 teaspoons baking soda\n1 teaspoon salt\n2 eggs\n1 cup milk\n1⁄2 cup vegetable oil\n2 teaspoons vanilla extract\n3⁄4-1 cup boiling water (see note below)",
  "directions": "- Heat oven to 350°F.\n- Grease and flour two 9 inch round baking pans or one 13x9 inch pan.\n- In large mixer bowl, stir together dry ingredients.\n- Add eggs, milk, oil, and vanilla; beat on medium speed for 2 minutes.\n- Stir in boiling water by hand (batter will be thin).\n- Pour into prepared pan.\n- Bake 30 to 35 minutes for round 9-inch pans, 35 to 40 minutes for rectangular pan or until wooden pick inserted in center comes out clean.\n(Do not use 8-inch pans or the batter will overflow.).\n- Because they have a tendency to overflow if you fill them more than 2/3 full, I usually get about 27-28 cupcakes per batch.\nBake for approximately 18-20 minutes.\n- Cool 10 minutes; remove from pan to wire racks.\nPlease note: baking cocoa isn't hot chocolate drink mix! Baking cocoa contains no sugar and it is found on the baking aisle.\nChocolate drink mixes that you add to milk or water to drink WILL NOT work in this recipe."
},{
  "recipe" : "Roasted Asparagus",
  "recipe-id": "3",
  "photo_url": "assets/asparagus.jpg",
  "ingredients": "1 lb asparagus\n1 1⁄2 tablespoons olive oil\n1⁄2 teaspoon kosher salt",
  "directions": "- Cut off the woody bottom part of the asparagus spears and discard.\n- With a vegetable peeler, peel off the skin on the bottom 2-3 inches of the spears (this keeps the asparagus from being all 'stringy' and if you eat asparagus you know what I mean by that).\n- Place asparagus on foil-lined baking sheet and drizzle with olive oil.\n- Sprinkle with salt.\n- With your hands, roll the asparagus around until they are evenly coated with oil and salt.\n- Roast for 10-15 minutes, depending on the thickness of your stalks and how tender you like them.\n- They should be tender when pierced with the tip of a knife.\n- The tips of the spears will get very brown but watch them to prevent burning.\n- They are great plain, but sometimes I serve them with a light vinaigrette if we need something acidic to balance out our meal."
}]